GopalSaraf/Practicals/PSDL/include/proc/pic18f25k40.inc
// Register: WPUC
#define WPUC WPUC
WPUC                                     equ 0F20h
// bitfield definitions
WPUC_WPUC0_POSN                          equ 0000h
WPUC_WPUC0_POSITION                      equ 0000h
WPUC_WPUC0_SIZE                          equ 0001h
WPUC_WPUC0_LENGTH                        equ 0001h
WPUC_WPUC0_MASK                          equ 0001h
WPUC_WPUC1_POSN                          equ 0001h
WPUC_WPUC1_POSITION                      equ 0001h
WPUC_WPUC1_SIZE                          equ 0001h
WPUC_WPUC1_LENGTH                        equ 0001h
WPUC_WPUC1_MASK                          equ 0002h
WPUC_WPUC2_POSN                          equ 0002h
WPUC_WPUC2_POSITION                      equ 0002h
WPUC_WPUC2_SIZE                          equ 0001h
WPUC_WPUC2_LENGTH                        equ 0001h
WPUC_WPUC2_MASK                          equ 0004h
WPUC_WPUC3_POSN                          equ 0003h
WPUC_WPUC3_POSITION                      equ 0003h
WPUC_WPUC3_SIZE                          equ 0001h
WPUC_WPUC3_LENGTH                        equ 0001h
WPUC_WPUC3_MASK                          equ 0008h
WPUC_WPUC4_POSN                          equ 0004h
WPUC_WPUC4_POSITION                      equ 0004h
WPUC_WPUC4_SIZE                          equ 0001h
WPUC_WPUC4_LENGTH                        equ 0001h
WPUC_WPUC4_MASK                          equ 0010h
WPUC_WPUC5_POSN                          equ 0005h
WPUC_WPUC5_POSITION                      equ 0005h
WPUC_WPUC5_SIZE                          equ 0001h
WPUC_WPUC5_LENGTH                        equ 0001h
WPUC_WPUC5_MASK                          equ 0020h
WPUC_WPUC6_POSN                          equ 0006h
WPUC_WPUC6_POSITION                      equ 0006h
WPUC_WPUC6_SIZE                          equ 0001h
WPUC_WPUC6_LENGTH                        equ 0001h
WPUC_WPUC6_MASK                          equ 0040h
WPUC_WPUC7_POSN                          equ 0007h
WPUC_WPUC7_POSITION                      equ 0007h
WPUC_WPUC7_SIZE                          equ 0001h
WPUC_WPUC7_LENGTH                        equ 0001h
WPUC_WPUC7_MASK                          equ 0080h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 0F21h
// bitfield definitions
ANSELC_ANSELC0_POSN                      equ 0000h
ANSELC_ANSELC0_POSITION                  equ 0000h
ANSELC_ANSELC0_SIZE                      equ 0001h
ANSELC_ANSELC0_LENGTH                    equ 0001h
ANSELC_ANSELC0_MASK                      equ 0001h
ANSELC_ANSELC1_POSN                      equ 0001h
ANSELC_ANSELC1_POSITION                  equ 0001h
ANSELC_ANSELC1_SIZE                      equ 0001h
ANSELC_ANSELC1_LENGTH                    equ 0001h
ANSELC_ANSELC1_MASK                      equ 0002h
ANSELC_ANSELC2_POSN                      equ 0002h
ANSELC_ANSELC2_POSITION                  equ 0002h
ANSELC_ANSELC2_SIZE                      equ 0001h
ANSELC_ANSELC2_LENGTH                    equ 0001h
ANSELC_ANSELC2_MASK                      equ 0004h
ANSELC_ANSELC3_POSN                      equ 0003h
ANSELC_ANSELC3_POSITION                  equ 0003h
ANSELC_ANSELC3_SIZE                      equ 0001h
ANSELC_ANSELC3_LENGTH                    equ 0001h
ANSELC_ANSELC3_MASK                      equ 0008h
ANSELC_ANSELC4_POSN                      equ 0004h
ANSELC_ANSELC4_POSITION                  equ 0004h
ANSELC_ANSELC4_SIZE                      equ 0001h
ANSELC_ANSELC4_LENGTH                    equ 0001h
ANSELC_ANSELC4_MASK                      equ 0010h
ANSELC_ANSELC5_POSN                      equ 0005h
ANSELC_ANSELC5_POSITION                  equ 0005h
ANSELC_ANSELC5_SIZE                      equ 0001h
ANSELC_ANSELC5_LENGTH                    equ 0001h
ANSELC_ANSELC5_MASK                      equ 0020h
ANSELC_ANSELC6_POSN                      equ 0006h
ANSELC_ANSELC6_POSITION                  equ 0006h
ANSELC_ANSELC6_SIZE                      equ 0001h
ANSELC_ANSELC6_LENGTH                    equ 0001h
ANSELC_ANSELC6_MASK                      equ 0040h
ANSELC_ANSELC7_POSN                      equ 0007h
ANSELC_ANSELC7_POSITION                  equ 0007h
ANSELC_ANSELC7_SIZE                      equ 0001h
ANSELC_ANSELC7_LENGTH                    equ 0001h
ANSELC_ANSELC7_MASK                      equ 0080h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0F27h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 0F28h
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 0F29h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0F2Ah
// bitfield definitions
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0F2Dh
// bitfield definitions
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: HLVDCON0
#define HLVDCON0 HLVDCON0
HLVDCON0                                 equ 0F2Fh
// bitfield definitions
HLVDCON0_INTL_POSN                       equ 0000h
HLVDCON0_INTL_POSITION                   equ 0000h
HLVDCON0_INTL_SIZE                       equ 0001h
HLVDCON0_INTL_LENGTH                     equ 0001h
HLVDCON0_INTL_MASK                       equ 0001h
HLVDCON0_INTH_POSN                       equ 0001h
HLVDCON0_INTH_POSITION                   equ 0001h
HLVDCON0_INTH_SIZE                       equ 0001h
HLVDCON0_INTH_LENGTH                     equ 0001h
HLVDCON0_INTH_MASK                       equ 0002h
HLVDCON0_RDY_POSN                        equ 0004h
HLVDCON0_RDY_POSITION                    equ 0004h
HLVDCON0_RDY_SIZE                        equ 0001h
HLVDCON0_RDY_LENGTH                      equ 0001h
HLVDCON0_RDY_MASK                        equ 0010h
HLVDCON0_OUT_POSN                        equ 0005h
HLVDCON0_OUT_POSITION                    equ 0005h
HLVDCON0_OUT_SIZE                        equ 0001h
HLVDCON0_OUT_LENGTH                      equ 0001h
HLVDCON0_OUT_MASK                        equ 0020h
HLVDCON0_EN_POSN                         equ 0007h
HLVDCON0_EN_POSITION                     equ 0007h
HLVDCON0_EN_SIZE                         equ 0001h
HLVDCON0_EN_LENGTH                       equ 0001h
HLVDCON0_EN_MASK                         equ 0080h
HLVDCON0_HLVDINTL_POSN                   equ 0000h
HLVDCON0_HLVDINTL_POSITION               equ 0000h
HLVDCON0_HLVDINTL_SIZE                   equ 0001h
HLVDCON0_HLVDINTL_LENGTH                 equ 0001h
HLVDCON0_HLVDINTL_MASK                   equ 0001h
HLVDCON0_HLVDINTH_POSN                   equ 0001h
HLVDCON0_HLVDINTH_POSITION               equ 0001h
HLVDCON0_HLVDINTH_SIZE                   equ 0001h
HLVDCON0_HLVDINTH_LENGTH                 equ 0001h
HLVDCON0_HLVDINTH_MASK                   equ 0002h
HLVDCON0_HLVDRDY_POSN                    equ 0004h
HLVDCON0_HLVDRDY_POSITION                equ 0004h
HLVDCON0_HLVDRDY_SIZE                    equ 0001h
HLVDCON0_HLVDRDY_LENGTH                  equ 0001h
HLVDCON0_HLVDRDY_MASK                    equ 0010h
HLVDCON0_HLVDOUT_POSN                    equ 0005h
HLVDCON0_HLVDOUT_POSITION                equ 0005h
HLVDCON0_HLVDOUT_SIZE                    equ 0001h
HLVDCON0_HLVDOUT_LENGTH                  equ 0001h
HLVDCON0_HLVDOUT_MASK                    equ 0020h
HLVDCON0_HLVDEN_POSN                     equ 0007h
HLVDCON0_HLVDEN_POSITION                 equ 0007h
HLVDCON0_HLVDEN_SIZE                     equ 0001h
HLVDCON0_HLVDEN_LENGTH                   equ 0001h
HLVDCON0_HLVDEN_MASK                     equ 0080h

// Register: HLVDCON1
#define HLVDCON1 HLVDCON1
HLVDCON1                                 equ 0F30h
// bitfield definitions
HLVDCON1_SEL_POSN                        equ 0000h
HLVDCON1_SEL_POSITION                    equ 0000h
HLVDCON1_SEL_SIZE                        equ 0004h
HLVDCON1_SEL_LENGTH                      equ 0004h
HLVDCON1_SEL_MASK                        equ 000Fh
HLVDCON1_SEL0_POSN                       equ 0000h
HLVDCON1_SEL0_POSITION                   equ 0000h
HLVDCON1_SEL0_SIZE                       equ 0001h
HLVDCON1_SEL0_LENGTH                     equ 0001h
HLVDCON1_SEL0_MASK                       equ 0001h
HLVDCON1_SEL1_POSN                       equ 0001h
HLVDCON1_SEL1_POSITION                   equ 0001h
HLVDCON1_SEL1_SIZE                       equ 0001h
HLVDCON1_SEL1_LENGTH                     equ 0001h
HLVDCON1_SEL1_MASK                       equ 0002h
HLVDCON1_SEL2_POSN                       equ 0002h
HLVDCON1_SEL2_POSITION                   equ 0002h
HLVDCON1_SEL2_SIZE                       equ 0001h
HLVDCON1_SEL2_LENGTH                     equ 0001h
HLVDCON1_SEL2_MASK                       equ 0004h
HLVDCON1_SEL3_POSN                       equ 0003h
HLVDCON1_SEL3_POSITION                   equ 0003h
HLVDCON1_SEL3_SIZE                       equ 0001h
HLVDCON1_SEL3_LENGTH                     equ 0001h
HLVDCON1_SEL3_MASK                       equ 0008h
HLVDCON1_HLVDSEL0_POSN                   equ 0000h
HLVDCON1_HLVDSEL0_POSITION               equ 0000h
HLVDCON1_HLVDSEL0_SIZE                   equ 0001h
HLVDCON1_HLVDSEL0_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL0_MASK                   equ 0001h
HLVDCON1_HLVDSEL1_POSN                   equ 0001h
HLVDCON1_HLVDSEL1_POSITION               equ 0001h
HLVDCON1_HLVDSEL1_SIZE                   equ 0001h
HLVDCON1_HLVDSEL1_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL1_MASK                   equ 0002h
HLVDCON1_HLVDSEL2_POSN                   equ 0002h
HLVDCON1_HLVDSEL2_POSITION               equ 0002h
HLVDCON1_HLVDSEL2_SIZE                   equ 0001h
HLVDCON1_HLVDSEL2_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL2_MASK                   equ 0004h
HLVDCON1_HLVDSEL3_POSN                   equ 0003h
HLVDCON1_HLVDSEL3_POSITION               equ 0003h
HLVDCON1_HLVDSEL3_SIZE                   equ 0001h
HLVDCON1_HLVDSEL3_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL3_MASK                   equ 0008h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 0F31h
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_RDY_POSN                          equ 0006h
FVRCON_RDY_POSITION                      equ 0006h
FVRCON_RDY_SIZE                          equ 0001h
FVRCON_RDY_LENGTH                        equ 0001h
FVRCON_RDY_MASK                          equ 0040h
FVRCON_EN_POSN                           equ 0007h
FVRCON_EN_POSITION                       equ 0007h
FVRCON_EN_SIZE                           equ 0001h
FVRCON_EN_LENGTH                         equ 0001h
FVRCON_EN_MASK                           equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h

// Register: ZCDCON
#define ZCDCON ZCDCON
ZCDCON                                   equ 0F32h
// bitfield definitions
ZCDCON_INTN_POSN                         equ 0000h
ZCDCON_INTN_POSITION                     equ 0000h
ZCDCON_INTN_SIZE                         equ 0001h
ZCDCON_INTN_LENGTH                       equ 0001h
ZCDCON_INTN_MASK                         equ 0001h
ZCDCON_INTP_POSN                         equ 0001h
ZCDCON_INTP_POSITION                     equ 0001h
ZCDCON_INTP_SIZE                         equ 0001h
ZCDCON_INTP_LENGTH                       equ 0001h
ZCDCON_INTP_MASK                         equ 0002h
ZCDCON_POL_POSN                          equ 0004h
ZCDCON_POL_POSITION                      equ 0004h
ZCDCON_POL_SIZE                          equ 0001h
ZCDCON_POL_LENGTH                        equ 0001h
ZCDCON_POL_MASK                          equ 0010h
ZCDCON_OUT_POSN                          equ 0005h
ZCDCON_OUT_POSITION                      equ 0005h
ZCDCON_OUT_SIZE                          equ 0001h
ZCDCON_OUT_LENGTH                        equ 0001h
ZCDCON_OUT_MASK                          equ 0020h
ZCDCON_SEN_POSN                          equ 0007h
ZCDCON_SEN_POSITION                      equ 0007h
ZCDCON_SEN_SIZE                          equ 0001h
ZCDCON_SEN_LENGTH                        equ 0001h
ZCDCON_SEN_MASK                          equ 0080h
ZCDCON_ZCDINTN_POSN                      equ 0000h
ZCDCON_ZCDINTN_POSITION                  equ 0000h
ZCDCON_ZCDINTN_SIZE                      equ 0001h
ZCDCON_ZCDINTN_LENGTH                    equ 0001h
ZCDCON_ZCDINTN_MASK                      equ 0001h
ZCDCON_ZCDINTP_POSN                      equ 0001h
ZCDCON_ZCDINTP_POSITION                  equ 0001h
ZCDCON_ZCDINTP_SIZE                      equ 0001h
ZCDCON_ZCDINTP_LENGTH                    equ 0001h
ZCDCON_ZCDINTP_MASK                      equ 0002h
ZCDCON_ZCDPOL_POSN                       equ 0004h
ZCDCON_ZCDPOL_POSITION                   equ 0004h
ZCDCON_ZCDPOL_SIZE                       equ 0001h
ZCDCON_ZCDPOL_LENGTH                     equ 0001h
ZCDCON_ZCDPOL_MASK                       equ 0010h
ZCDCON_ZCDOUT_POSN                       equ 0005h
ZCDCON_ZCDOUT_POSITION                   equ 0005h
ZCDCON_ZCDOUT_SIZE                       equ 0001h
ZCDCON_ZCDOUT_LENGTH                     equ 0001h
ZCDCON_ZCDOUT_MASK                       equ 0020h
ZCDCON_ZCDSEN_POSN                       equ 0007h
ZCDCON_ZCDSEN_POSITION                   equ 0007h
ZCDCON_ZCDSEN_SIZE                       equ 0001h
ZCDCON_ZCDSEN_LENGTH                     equ 0001h
ZCDCON_ZCDSEN_MASK                       equ 0080h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0F33h
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0001h
DAC1CON0_NSS_LENGTH                      equ 0001h
DAC1CON0_NSS_MASK                        equ 0001h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE2_POSN                        equ 0004h
DAC1CON0_OE2_POSITION                    equ 0004h
DAC1CON0_OE2_SIZE                        equ 0001h
DAC1CON0_OE2_LENGTH                      equ 0001h
DAC1CON0_OE2_MASK                        equ 0010h
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 0F34h
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0005h
DAC1CON1_DAC1R_LENGTH                    equ 0005h
DAC1CON1_DAC1R_MASK                      equ 001Fh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h

