GopalSaraf/Practicals/PSDL/include/proc/pic18f25k40.inc
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE2), 7, b
#define HLVDIF                           BANKMASK(PIR2), 7, b
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR2), 7, b
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C_DAT                          BANKMASK(SSP1STAT), 5, a
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5, a
#define I2C_READ                         BANKMASK(SSP1STAT), 2, a
#define I2C_READ1                        BANKMASK(SSP1STAT), 2, a
#define I2C_START                        BANKMASK(SSP1STAT), 3, a
#define I2C_START1                       BANKMASK(SSP1STAT), 3, a
#define I2C_STOP                         BANKMASK(SSP1STAT), 4, a
#define I2C_STOP2                        BANKMASK(SSP1STAT), 4, a
#define IDLEN                            BANKMASK(CPUDOZE), 7, b
#define IN                               BANKMASK(CWG1CON1), 5, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON), 0, a
#define INT0IE                           BANKMASK(PIE0), 0, b
#define INT0IF                           BANKMASK(PIR0), 0, b
#define INT0IP                           BANKMASK(IPR0), 0, b
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT1EDG                          BANKMASK(INTCON), 1, a
#define INT1IE                           BANKMASK(PIE0), 1, b
#define INT1IF                           BANKMASK(PIR0), 1, b
#define INT1IP                           BANKMASK(IPR0), 1, b
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT2EDG                          BANKMASK(INTCON), 2, a
#define INT2IE                           BANKMASK(PIE0), 2, b
#define INT2IF                           BANKMASK(PIR0), 2, b
#define INT2IP                           BANKMASK(IPR0), 2, b
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define INTM                             BANKMASK(SCANCON0), 3, b
#define INVALID                          BANKMASK(SCANCON0), 4, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 4, b
#define IOCIF                            BANKMASK(PIR0), 4, b
#define IOCIP                            BANKMASK(IPR0), 4, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IPEN                             BANKMASK(INTCON), 5, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD                               BANKMASK(CWG1CON0), 6, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define LVDIN                            BANKMASK(PORTA), 5, a
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MDBIT                            BANKMASK(MDCON0), 0, b
#define MDCARHPPS0                       BANKMASK(MDCARHPPS), 0, b
#define MDCARHPPS1                       BANKMASK(MDCARHPPS), 1, b
#define MDCARHPPS2                       BANKMASK(MDCARHPPS), 2, b
#define MDCARHPPS3                       BANKMASK(MDCARHPPS), 3, b
#define MDCARHPPS4                       BANKMASK(MDCARHPPS), 4, b
#define MDCARLPPS0                       BANKMASK(MDCARLPPS), 0, b
#define MDCARLPPS1                       BANKMASK(MDCARLPPS), 1, b
#define MDCARLPPS2                       BANKMASK(MDCARLPPS), 2, b
#define MDCARLPPS3                       BANKMASK(MDCARLPPS), 3, b
#define MDCARLPPS4                       BANKMASK(MDCARLPPS), 4, b
#define MDCHPOL                          BANKMASK(MDCON1), 5, b
#define MDCHS0                           BANKMASK(MDCARH), 0, b
#define MDCHS1                           BANKMASK(MDCARH), 1, b
#define MDCHS2                           BANKMASK(MDCARH), 2, b
#define MDCHSYNC                         BANKMASK(MDCON1), 4, b
#define MDCLPOL                          BANKMASK(MDCON1), 1, b
#define MDCLS0                           BANKMASK(MDCARL), 0, b
#define MDCLS1                           BANKMASK(MDCARL), 1, b
#define MDCLS2                           BANKMASK(MDCARL), 2, b
#define MDCLSYNC                         BANKMASK(MDCON1), 0, b
#define MDEN                             BANKMASK(MDCON0), 7, b
#define MDOPOL                           BANKMASK(MDCON0), 4, b
#define MDOUT                            BANKMASK(MDCON0), 5, b
#define MDSRCPPS0                        BANKMASK(MDSRCPPS), 0, b
#define MDSRCPPS1                        BANKMASK(MDSRCPPS), 1, b
#define MDSRCPPS2                        BANKMASK(MDSRCPPS), 2, b
#define MDSRCPPS3                        BANKMASK(MDSRCPPS), 3, b
#define MDSRCPPS4                        BANKMASK(MDSRCPPS), 4, b
#define MDSRCS0                          BANKMASK(MDSRC), 0, b
#define MDSRCS1                          BANKMASK(MDSRC), 1, b
#define MDSRCS2                          BANKMASK(MDSRC), 2, b
#define MDSRCS3                          BANKMASK(MDSRC), 3, b
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSSP1MD                          BANKMASK(PMD4), 4, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_A2                           BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS1                     BANKMASK(SSP1STAT), 5, a
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_PD                           BANKMASK(STATUS), 5, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, a
#define NOT_TO                           BANKMASK(STATUS), 6, a
#define NOT_W2                           BANKMASK(SSP1STAT), 2, a
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE1                       BANKMASK(SSP1STAT), 2, a
#define NSS                              BANKMASK(DAC1CON0), 0, b
#define NVMADR0                          BANKMASK(NVMADR), 0, a
#define NVMADR1                          BANKMASK(NVMADR), 1, a
#define NVMADR2                          BANKMASK(NVMADR), 2, a
#define NVMADR3                          BANKMASK(NVMADR), 3, a
#define NVMADR4                          BANKMASK(NVMADR), 4, a
#define NVMADR5                          BANKMASK(NVMADR), 5, a
#define NVMADR6                          BANKMASK(NVMADR), 6, a
#define NVMADR7                          BANKMASK(NVMADR), 7, a
#define NVMDAT0                          BANKMASK(NVMDAT), 0, a
#define NVMDAT1                          BANKMASK(NVMDAT), 1, a
#define NVMDAT2                          BANKMASK(NVMDAT), 2, a
#define NVMDAT3                          BANKMASK(NVMDAT), 3, a
#define NVMDAT4                          BANKMASK(NVMDAT), 4, a
#define NVMDAT5                          BANKMASK(NVMDAT), 5, a
#define NVMDAT6                          BANKMASK(NVMDAT), 6, a
#define NVMDAT7                          BANKMASK(NVMDAT), 7, a
#define NVMIE                            BANKMASK(PIE7), 5, b
#define NVMIF                            BANKMASK(PIR7), 5, b
#define NVMIP                            BANKMASK(IPR7), 5, b
#define NVMMD                            BANKMASK(PMD0), 2, b
#define NVMREG0                          BANKMASK(NVMCON1), 6, a
#define NVMREG1                          BANKMASK(NVMCON1), 7, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define OE1                              BANKMASK(DAC1CON0), 5, b
#define OE2                              BANKMASK(DAC1CON0), 4, b
#define OERR                             BANKMASK(RC1STA), 1, a
#define OPOL                             BANKMASK(MDCON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define OSCFIE                           BANKMASK(PIE1), 7, b
#define OSCFIF                           BANKMASK(PIR1), 7, b
#define OSCFIP                           BANKMASK(IPR1), 7, b
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P2                               BANKMASK(SSP1STAT), 4, a
#define P3TSEL0                          BANKMASK(CCPTMRS), 4, a
#define P3TSEL1                          BANKMASK(CCPTMRS), 5, a
#define P4TSEL0                          BANKMASK(CCPTMRS), 6, a
#define P4TSEL1                          BANKMASK(CCPTMRS), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
